Cleaning Data - Casting Datatypes and Handling Missing Values

In [2]:
import pandas as pd
import numpy as np

In [13]:
# Working with example dataframe
people = {
    "first" : ["Anish", "Ramish",None, "Samish", np.nan,"Bamish", np.nan, 'NA'],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki", "Mainali", np.nan, np.nan, 'Missing'],
    "email" : [None, "mainaliramish89@gmail.com", 
               "shresthasamish28@gmail.com", None,"bamishkarki819@gmail.com",
               "bamishmainali78@gmail.com", np.nan, 'Missing'],
    "age": ['23', '24', '22', '26', '27', None, None, 'Missing']

}
mydf = pd.DataFrame(people)
mydf

    first      last                       email      age
0   Anish    Khadka                        None       23
1  Ramish   Mainali   mainaliramish89@gmail.com       24
2    None  Shrestha  shresthasamish28@gmail.com       22
3  Samish     Karki                        None       26
4     NaN   Mainali    bamishkarki819@gmail.com       27
5  Bamish       NaN   bamishmainali78@gmail.com     None
6     NaN       NaN                         NaN     None
7      NA   Missing                     Missing  Missing

In [14]:
# simply drop NA
mydf.dropna()

    first     last                      email      age
1  Ramish  Mainali  mainaliramish89@gmail.com       24
7      NA  Missing                    Missing  Missing

In [15]:
# index : drop the rows
# drop any row with a missing value
# how = all, when all are missing
mydf.dropna(axis='index', how='any')

    first     last                      email      age
1  Ramish  Mainali  mainaliramish89@gmail.com       24
7      NA  Missing                    Missing  Missing

In [16]:
mydf.dropna(axis='index', how='all')

    first      last                       email      age
0   Anish    Khadka                        None       23
1  Ramish   Mainali   mainaliramish89@gmail.com       24
2    None  Shrestha  shresthasamish28@gmail.com       22
3  Samish     Karki                        None       26
4     NaN   Mainali    bamishkarki819@gmail.com       27
5  Bamish       NaN   bamishmainali78@gmail.com     None
7      NA   Missing                     Missing  Missing

In [ ]:
mydf.dropna(axis='columns', how='all') # no column with all values empty

    first      last                       email      age
0   Anish    Khadka                        None       23
1  Ramish   Mainali   mainaliramish89@gmail.com       24
2    None  Shrestha  shresthasamish28@gmail.com       22
3  Samish     Karki                        None       26
4     NaN   Mainali    bamishkarki819@gmail.com       27
5  Bamish       NaN   bamishmainali78@gmail.com     None
6     NaN       NaN                         NaN     None
7      NA   Missing                     Missing  Missing

In [ ]:
mydf.dropna(axis='index', how='any', subset=['email']) # check if there is email

    first      last                       email      age
1  Ramish   Mainali   mainaliramish89@gmail.com       24
2    None  Shrestha  shresthasamish28@gmail.com       22
4     NaN   Mainali    bamishkarki819@gmail.com       27
5  Bamish       NaN   bamishmainali78@gmail.com     None
7      NA   Missing                     Missing  Missing

In [ ]:
mydf.dropna(axis='index', how='all', subset=['last', 'email']) # both columns must be NaN to be dropped
# any would mean if any value is missing, the row will be dropped
# use inplace=True to change the dataframe in place

    first      last                       email      age
0   Anish    Khadka                        None       23
1  Ramish   Mainali   mainaliramish89@gmail.com       24
2    None  Shrestha  shresthasamish28@gmail.com       22
3  Samish     Karki                        None       26
4     NaN   Mainali    bamishkarki819@gmail.com       27
5  Bamish       NaN   bamishmainali78@gmail.com     None
7      NA   Missing                     Missing  Missing

In [26]:
# How to deal with 'NA' or 'Missing' values in the dataframe?
mydf.replace('NA', np.nan, inplace=True)
mydf.replace('Missing', np.nan, inplace=True)
mydf

    first      last                       email   age
0   Anish    Khadka                        None    23
1  Ramish   Mainali   mainaliramish89@gmail.com    24
2    None  Shrestha  shresthasamish28@gmail.com    22
3  Samish     Karki                        None    26
4     NaN   Mainali    bamishkarki819@gmail.com    27
5  Bamish       NaN   bamishmainali78@gmail.com  None
6     NaN       NaN                         NaN  None
7     NaN       NaN                         NaN   NaN

In [27]:
# run the previous line again
mydf.dropna(axis='index', how='all', subset=['last', 'email'])

    first      last                       email   age
0   Anish    Khadka                        None    23
1  Ramish   Mainali   mainaliramish89@gmail.com    24
2    None  Shrestha  shresthasamish28@gmail.com    22
3  Samish     Karki                        None    26
4     NaN   Mainali    bamishkarki819@gmail.com    27
5  Bamish       NaN   bamishmainali78@gmail.com  None

In [28]:
# To check isna()
mydf.isna()

   first   last  email    age
0  False  False   True  False
1  False  False  False  False
2   True  False  False  False
3  False  False   True  False
4   True  False  False  False
5  False   True  False   True
6   True   True   True   True
7   True   True   True   True

In [29]:
# You could replace NA with anything
mydf.fillna('MISSING')

     first      last                       email      age
0    Anish    Khadka                     MISSING       23
1   Ramish   Mainali   mainaliramish89@gmail.com       24
2  MISSING  Shrestha  shresthasamish28@gmail.com       22
3   Samish     Karki                     MISSING       26
4  MISSING   Mainali    bamishkarki819@gmail.com       27
5   Bamish   MISSING   bamishmainali78@gmail.com  MISSING
6  MISSING   MISSING                     MISSING  MISSING
7  MISSING   MISSING                     MISSING  MISSING

In [30]:
mydf.fillna(0)

    first      last                       email age
0   Anish    Khadka                           0  23
1  Ramish   Mainali   mainaliramish89@gmail.com  24
2       0  Shrestha  shresthasamish28@gmail.com  22
3  Samish     Karki                           0  26
4       0   Mainali    bamishkarki819@gmail.com  27
5  Bamish         0   bamishmainali78@gmail.com   0
6       0         0                           0   0
7       0         0                           0   0

In [ ]:
# Casting data types